projectFiles/bentPipe/Re100/q-1000/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   heatWall
    {
	type            nutkWallFunction;
        value           uniform 0;  
    }
   wall
    {
	type            nutkWallFunction;
        value           uniform 0; 
    }
    outlet
    {
	type            calculated;
        value           uniform 0;
    }


    inlet
    {
	type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
